package org.thunlp.language.chinese;

public class ChineseLanguageConstants {
  public static int ORG = 0;
  public static int TRANS = 1;
  public static String [] SPACE = {"　", " "};
  public static String [] ENCLOSING_MARKS = { 
	    "“”｛｝［］《》（）‘’「」【】",
	    "\"\"{}[]<>()''\"\"[]"
  };
  public static String [] SENTENCE_SEPARATORS = { 
    "。！？", 
    ".!?" 
  };
  public static String [] IN_SENTENCE__SEPARATORS = {
    "：；～，／｀＠＃￥％……＆＊－＝——＋、｜",
    ":;~,/`@#$%^&*-=_+\\|"
  };
  public static String [] ALL_MARKS = {
    ENCLOSING_MARKS[0] + SENTENCE_SEPARATORS[0] + IN_SENTENCE__SEPARATORS[0],
    ENCLOSING_MARKS[1] + SENTENCE_SEPARATORS[1] + IN_SENTENCE__SEPARATORS[1]
  };

  public static int ENGLISH_START = 49;
  public static int ENGLISH_END =109;
  public static int CHINESE_START = 19968;
  public static int CHINESE_END = 40869;
  public static int JAPANESE_START = 12353;
  public static int JAPANESE_END = 12543;
  public static int KOREAN_START = 44032;
  public static int KOREAN_END = 55203;

  public static String SIMPLIFIED_CHARS = "万与丑专业丛东丝丢两严丧个个丬丰临为丽举乃么义乌乐乔习乡书买乱争于亏云亘亚产亩亲亵亸亿仅仆从仑仑仓"
			+ "仪们价众优伙会伛伞伞伟传伤伥伦伧伪伫佑体余佛佣佥佩侄侠侣侥侦侧侨侩侪侬俣俦俨俩俪俭修俯债倾偬偷偻偾偿"
			+ "傥傧储傩儿克兑兖党兰关兴兹养兽冁内冈册写军农冢冬冯冱冲冲决况冻净凄准凉凌减凑凛几凤凫凭凯出击凼凿刍划"
			+ "刘则刚创删刨别别刬刭刮制刽刿剀剂剐剑剥剧剩剿劝办务劢动励劲劳势勋勐勖勚匀匦匮区医千升升华协单卖卜占卢"
			+ "卤卤卧卫却卷卺厂厅历历厉压厌厍厕厘厢厣厦厨厩厮县参叆叇双发发变叙叠只台台台叶号叹叹叽吁吁吃合合吊后向"
			+ "向吓吕吗吣吨听启吴呆呒呓呕呖呗员呙呛呜周呵呼咏咔咙咛咝咤咨咱咴咸咽哄哌响哑哒哓哔哕哗哗哙哜哝哟唇唛唝"
			+ "唠唡唢唣唤唿啧啬啭啮啰啴啸喂喷喽喾嗫嗳嘘嘤嘱嘻噜噪噼嚣嚯回团团园困囱围囵国图圆圣圹场址坂坏块坚坛坛坜"
			+ "坝坞坟坠垄垅垆垆垒垦垧垩垫垭垯垱垲垴埘埙埙埚埝埯堑堕堤塆墉墙壮声壳壶壸处备复复够夫头夸夹夺奁奂奋奖奥"
			+ "奶奸妆妇妈妩妪妫姗姜娄娅娆娇娈娘娱娲娴婳婴婵婶媪嫒嫔嫱嬷孙学孪宁宁宝实宠审宪宫家宽宾寝对寻导寿将尔尘"
			+ "尝尝尧尴尸尽尽局局层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岩岩岭岳岽岿峃峄峡峣峤峥峦崂崃崄崭嵘嵚嵛嵝嵴巅巨巩"
			+ "巯币布帅师帏帐帘帜带帧席帮帱帻帼幂幞干干干并幸广庄庆床庐庑库应庙庞废庵庼廪开异弃张弥弥弦弪弯弹强强归"
			+ "当录彟彦彩彷彻征径径徕御忆忏志忧念忾怀态怂怃怄怅怆怜总怼怿恋恒恤恳恶恶恸恹恺恻恼恽悦悫悬悭悯惊惧惨惩"
			+ "惫惬惭惮惯愈愍愠愤愦愿慑慑慭憷懑懒懔戆戋戏戗战戚戬户扎扑托扣扦执扩扪扫扬扬扰折抚抛抟抠抡抢护报抵抵担"
			+ "拐拟拢拣拥拦拧拨择拼挂挚挛挜挝挞挟挠挡挡挢挣挤挥挦挽捆捆捞损捡换捣据捻掳掴掷掸掺掼揸揽揿搀搁搂搅搜携"
			+ "摄摅摆摇摈摊撄撑撵撷撸撺擞攒敌敛数斋斓斗斩断旋旗无旧时旷旸昆昙昵昼昽显晋晒晓晔晕晖暂暖暧曲札术朱朴机"
			+ "杀杂权杆条来杨杩杯杰松板极构构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊栋栌栎栏树栖栗样核栾桊桠桡桢档桤桥"
			+ "桦桧桨桩梦梼梾检棂棂棰棱棹椁椟椠椤椭楼榄榇榈榉榨槚槛槟槠模横樯樱橥橱橹橼檐檩欢欢欣欤欧欲歼殁殇残殒殓"
			+ "殚殡殴殷毁毁毂毕毙毡毵氇气氢氩氲汇汇汉污汤汹沓沟没没沣沤沥沦沧沨沩沪沵沾泄泛泛泞注泪泶泷泸泺泻泼泽泾"
			+ "洁洒洼浃浅浆浇浈浉浊测浍济浏浐浑浒浓浔浕浚涂涌涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渖渗温游湾湿"
			+ "溃溅溆溇溜溪滗滚滞滟滟滠满滢滤滥滦滨滩滪漓漤潆潇潋潍潜潴澄澜濑濒灏灭灯灵灾灿炀炉炉炖炜炝炮点炼炼炽烁"
			+ "烂烃烛烟烟烦烧烨烩烫烬热焊焊焕焖焘煅照煳熏熘燕燕爱爷牍牦牦牵牺犊犟状犷犸犹狈狍狝狞独狭狮狯狰狱狲狸猃"
			+ "猎猕猡猪猫猬献獭玑玙玚玛玮环现玱玺珉珏珐珑珰珲球琅琎琏琐琼瑶瑷璇璎瓒瓮瓮瓯电画畅畲畴疖疗疟疠疡疬疮疯"
			+ "疱疴症痈痉痒痖痨痪痫痴痹瘅瘆瘗瘘瘪瘫瘾瘿癞癣癫癯皑皱皲盏盐监盖盗盘盘盘眍眦眬眺着睁睐睑瞒瞩矫矶矾矿砀"
			+ "码砖砖砗砚砜砺砻砾础硁硅硕硖硗硗硙硚确硷碍碛碜碱碱碹磙磷礼祎祢祯祷祸禀禄禅离秃秆秋种秘积称秽秾稆税稣"
			+ "稳穑穷窃窍窑窜窝窥窥窦窭竖竞端笃笋笔笕笺笺笼笾筑筚筛筜筝筱筹签签简箓管箦箧箨箩箪箫篑篓篮篱簖籁籴类籼"
			+ "粜粝粤粪粮糁糇系系紧累絷纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线绀绁绁绂练"
			+ "组绅细织终绉绊绋绌绍绎经绐绑绒绒结绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦绦继绨绩绪绫绬续绮绯绰绱绲绳"
			+ "维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缊缋缌缍缎缏缐缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤"
			+ "缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵罂罂网罗罚罢罴羁羟羡翘翙翚翻考耢耧耸耻聂聋职聍联聩聪肃肠肤肴肷肾肿"
			+ "胀胁胆背胜胡胡胧胨胪胫胶脉脍脏脏脐脑脓脔脚脱脶脸腊腌腘腭腻腼腽腾膑臜致舄舆舍舣舰舱舻艰艳艹艺节芈芗芜"
			+ "芦芸苁苇苈苋苌苍苎苏苏苘苹范茎茏茑茔茕茧荆荐荙荚荛荜荞荟荠荡荡荣荤荥荦荧荨荩荪荫荬荭荮药药莅莜莱莲莳"
			+ "莴莶获获莸莹莺莼萚萝萤营萦萧萨葱蒇蒉蒋蒌蒙蒙蓑蓝蓟蓠蓣蓥蓦蔑蔷蔹蔺蔼蕲蕴薮藁藓藤虏虑虚虫虬虮虱虽虾虿"
			+ "蚀蚁蚁蚂蚕蚝蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蜡蜷蝇蝈蝉蝎蝼蝾螀螨蟏衅衔衔补表衬衮袄袅袅袆袜袭袯装裆裈裢裣裤裥"
			+ "褛褴襁襕见观觃规觅视觇览觉觊觋觌觍觎觏觐觑觞触觯詟誉誊讠计订讣认讥讦讧讨让讪讫训议讯记讱讲讳讴讵讶讷"
			+ "许讹论讻讼讽设访诀证证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨"
			+ "诩诪诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛"
			+ "谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货质贩贪贫贬购贮贯贰贱"
			+ "贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赞赟赠赡赢"
			+ "赣赪赵赶趋趱趸跃跄跖跞践跶跷跸跹跻踊踌踪踬踯蹑蹒蹰蹿躏躜躯车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺"
			+ "轻轼载轾轿辀辁辂较辄辅辆辇辈辉辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辞辟辩辫边辽达迁过迈运还这进远违连"
			+ "迟迩迭迳迹迹适选逊递逦逻遗遥邓邝邬邮邹邺邻郁郄郏郐郑郓郦郧郸酝酦酰酱酸酽酾酿采释里里鉅鉴鉴銮錾钆钇针"
			+ "针钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钝钞钟钟钠钡钢钣钤钥钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钶钷钸"
			+ "钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铌铍铎铏铐铑铒铓铔铕铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬"
			+ "铭铮铯铰铱铲铲铳铴铵银铷铸铹铺铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗错锚锛锜锞"
			+ "锟锠锡锢锣锤锤锥锦锧锨锩锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镅镆镇镈镉镊镋镌镍镎镏镐镑"
			+ "镒镓镔镕镖镗镘镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲镳镴镵镶长门闩闪闫闬闭问闯闰闱闲闲"
			+ "闳间闵闶闷闸闹闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇"
			+ "陈陉陕陧陨险随隐隶隽难雇雏雕雠雳雾霁霉霭靓静面靥鞑鞒鞯鞴韦韧韨韩韪韫韬韵页顶顷顸项顺须须顼顽顾顿颀颁"
			+ "颂颃预颅领颇颈颉颊颋颌颍颎颏颐频颒颓颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风飏飐飑飒飓飔飕飖飗飘"
			+ "飙飚飞飨餍饤饥饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馈馉馊馋馌馍馎"
			+ "馏馐馑馒馓馔馕马驭驮驯驰驱驱驲驳驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏骐骑骒骓骔"
			+ "骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬃鬓魇魉鱼鱽鱾鱿鲀鲁鲂鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔"
			+ "鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅"
			+ "鳆鳇鳈鳉鳊鳋鳌鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳛鳜鳝鳞鳟鳠鳡鳢鳣鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲"
			+ "鸳鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹙鹚鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣"
			+ "鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹯鹰鹱鹲鹳鹴鹾麦麸黄黉黡黩黪黾鼋鼌鼍鼗鼹齄齐齑齿龀龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟";

	public static String TRADITIONAL_CHARS = "萬與醜專業叢東絲丟兩嚴喪個箇爿豐臨為麗舉迺麼義烏樂喬習鄉書買亂爭於虧雲亙亞產畝親褻嚲億僅僕從侖崙倉"
			+ "儀們價眾優夥會傴傘繖偉傳傷倀倫傖偽佇祐體餘彿傭僉珮姪俠侶僥偵側僑儈儕儂俁儔儼倆儷儉脩頫債傾傯媮僂僨償"
			+ "儻儐儲儺兒剋兌兗黨蘭關興茲養獸囅內岡冊寫軍農塚鼕馮沍衝沖決況凍淨淒準涼淩減湊凜幾鳳鳧憑凱齣擊氹鑿芻劃"
			+ "劉則剛創刪鉋別彆剗剄颳製劊劌剴劑剮劍剝劇賸勦勸辦務勱動勵勁勞勢勳猛勗勩勻匭匱區醫韆昇陞華協單賣蔔佔盧"
			+ "滷鹵臥衛卻捲巹廠廳歷曆厲壓厭厙廁釐廂厴廈廚廄廝縣參靉靆雙發髮變敘疊隻颱檯臺葉號歎嘆嘰訏籲喫郃閤弔後曏"
			+ "嚮嚇呂嗎唚噸聽啟吳獃嘸囈嘔嚦唄員咼嗆嗚週嗬唿詠哢嚨嚀噝吒谘偺噅鹹嚥鬨呱響啞噠嘵嗶噦嘩譁噲嚌噥喲脣嘜嗊"
			+ "嘮啢嗩唕喚呼嘖嗇囀齧囉嘽嘯餵噴嘍嚳囁噯噓嚶囑譆嚕譟劈囂謔迴糰團園睏囪圍圇國圖圓聖壙場阯阪壞塊堅罈壇壢"
			+ "壩塢墳墜壟壟罏壚壘墾坰堊墊埡墶壋塏堖塒壎塤堝墊垵塹墮隄壪鄘牆壯聲殼壺壼處備復複夠伕頭誇夾奪奩奐奮獎奧"
			+ "嬭姦妝婦媽嫵嫗媯姍薑婁婭嬈嬌孌孃娛媧嫻嫿嬰嬋嬸媼嬡嬪嬙嬤孫學孿甯寧寶實寵審憲宮傢寬賓寢對尋導壽將爾塵"
			+ "嚐嘗堯尷屍盡儘跼侷層屭屜屆屬屢屨嶼歲豈嶇崗峴嶴嵐島喦巖嶺嶽崠巋嶨嶧峽嶢嶠崢巒嶗崍嶮嶄嶸嶔崳嶁脊巔鉅鞏"
			+ "巰幣佈帥師幃帳簾幟帶幀蓆幫幬幘幗冪襆乾幹榦並倖廣莊慶牀廬廡庫應廟龐廢菴廎廩開異棄張彌瀰絃弳彎彈彊強歸"
			+ "當錄彠彥綵徬徹徵徑逕徠禦憶懺誌憂唸愾懷態慫憮慪悵愴憐總懟懌戀恆卹懇惡噁慟懨愷惻惱惲悅愨懸慳憫驚懼慘懲"
			+ "憊愜慚憚慣癒湣慍憤憒願懾慴憖怵懣懶懍戇戔戲戧戰慼戩戶紮撲託釦扡執擴捫掃揚颺擾摺撫拋摶摳掄搶護報牴觝擔"
			+ "枴擬攏揀擁攔擰撥擇拚掛摯攣掗撾撻挾撓攩擋撟掙擠揮撏輓綑梱撈損撿換搗據撚擄摑擲撣摻摜摣攬撳攙擱摟攪蒐攜"
			+ "攝攄擺搖擯攤攖撐攆擷擼攛擻攢敵斂數齋斕鬥斬斷鏇旂無舊時曠暘崑曇暱晝曨顯晉曬曉曄暈暉暫煖曖麴劄術硃樸機"
			+ "殺雜權桿條來楊榪盃傑鬆闆極構搆樅樞棗櫪梘棖槍楓梟櫃檸檉梔柵標棧櫛櫳棟櫨櫟欄樹棲慄樣覈欒棬椏橈楨檔榿橋"
			+ "樺檜槳樁夢檮棶檢櫺欞箠稜櫂槨櫝槧欏橢樓欖櫬櫚櫸搾檟檻檳櫧糢橫檣櫻櫫櫥櫓櫞簷檁歡懽訢歟歐慾殲歿殤殘殞殮"
			+ "殫殯毆慇燬毀轂畢斃氈毿氌氣氫氬氳彙匯漢汙湯洶遝溝沒冇灃漚瀝淪滄渢溈滬濔霑洩氾汎濘註淚澩瀧瀘濼瀉潑澤涇"
			+ "潔灑窪浹淺漿澆湞溮濁測澮濟瀏滻渾滸濃潯濜濬塗湧濤澇淶漣潿渦溳渙滌潤澗漲澀澱淵淥漬瀆漸澠漁瀋滲溫遊灣濕"
			+ "潰濺漵漊霤谿潷滾滯灧灩灄滿瀅濾濫灤濱灘澦灕濫瀠瀟瀲濰潛瀦澂瀾瀨瀕灝滅燈靈災燦煬爐鑪燉煒熗砲點鍊煉熾爍"
			+ "爛烴燭菸煙煩燒燁燴燙燼熱銲釬煥燜燾煆炤糊薰溜讌醼愛爺牘犛氂牽犧犢強狀獷獁猶狽麅獮獰獨狹獅獪猙獄猻貍獫"
			+ "獵獼玀豬貓蝟獻獺璣璵瑒瑪瑋環現瑲璽瑉玨琺瓏璫琿毬瑯璡璉瑣瓊瑤璦璿瓔瓚罋甕甌電畫暢佘疇癤療瘧癘瘍鬁瘡瘋"
			+ "皰屙癥癰痙癢瘂癆瘓癇癡痺癉瘮瘞瘺癟癱癮癭癩癬癲臒皚皺皸盞鹽監蓋盜盤槃磐瞘眥矓覜著睜睞瞼瞞矚矯磯礬礦碭"
			+ "碼磚塼硨硯碸礪礱礫礎硜矽碩硤墝磽磑礄確鹼礙磧磣堿鹼镟滾燐禮禕禰禎禱禍稟祿禪離禿稈鞦種祕積稱穢穠穭稅穌"
			+ "穩穡窮竊竅窯竄窩窺闚竇窶豎競耑篤筍筆筧箋牋籠籩築篳篩簹箏篠籌簽籤簡籙琯簀篋籜籮簞簫簣簍籃籬籪籟糴類秈"
			+ "糶糲粵糞糧糝餱係繫緊纍縶糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紖紐紓線紺絏紲紱練"
			+ "組紳細織終縐絆紼絀紹繹經紿綁羢絨結絝繞絰絎繪給絢絳絡絕絞統綆綃絹繡綌綏縚絛繼綈績緒綾緓續綺緋綽緔緄繩"
			+ "維綿綬繃綢綯綹綣綜綻綰綠綴緇緙緗緘緬纜緹緲緝縕緼繢緦綞緞緶線緱縋緩締縷編緡緣縉縛縟縝縫縗縞纏縭縊縑繽"
			+ "縹縵縲纓縮繆繅纈繚繕繒韁繾繰繯繳纘罌甖網羅罰罷羆羈羥羨翹翽翬繙攷耮耬聳恥聶聾職聹聯聵聰肅腸膚餚膁腎腫"
			+ "脹脅膽揹勝鬍衚朧腖臚脛膠脈膾髒臟臍腦膿臠腳脫腡臉臘醃膕齶膩靦膃騰臏臢緻潟輿捨艤艦艙艫艱豔艸藝節羋薌蕪"
			+ "蘆蕓蓯葦藶莧萇蒼苧蘇甦檾蘋範莖蘢蔦塋煢繭荊薦薘莢蕘蓽蕎薈薺蕩盪榮葷滎犖熒蕁藎蓀蔭蕒葒葤藥葯蒞蓧萊蓮蒔"
			+ "萵薟獲穫蕕瑩鶯蓴蘀蘿螢營縈蕭薩蔥蕆蕢蔣蔞矇濛簑藍薊蘺蕷鎣驀衊薔蘞藺藹蘄蘊藪槁蘚籐虜慮虛蟲虯蟣蝨雖蝦蠆"
			+ "蝕蟻螘螞蠶蠔蜆蠱蠣蟶蠻蟄蛺蟯螄蠐蛻蝸蠟踡蠅蟈蟬蠍螻蠑螿蟎蠨釁銜啣補錶襯袞襖嫋嬝褘襪襲襏裝襠褌褳襝褲襇"
			+ "褸襤繈襴見觀覎規覓視覘覽覺覬覡覿覥覦覯覲覷觴觸觶讋譽謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥"
			+ "許訛論訩訟諷設訪訣證証詁訶評詛識詗詐訴診詆謅詞詘詔詖譯詒誆誄試詿詩詰詼誠誅詵話誕詬詮詭詢詣諍該詳詫諢"
			+ "詡譸誡誣語誚誤誥誘誨誑說誦誒請諸諏諾讀諑誹課諉諛誰諗調諂諒諄誶談誼謀諶諜謊諫諧謔謁謂諤諭諼讒諮諳諺諦"
			+ "謎諞諝謨讜謖謝謠謗諡謙謐謹謾謫譾謬譚譖譙讕譜譎讞譴譫讖穀豶貝貞負貟貢財責賢敗賬貨質販貪貧貶購貯貫貳賤"
			+ "賁貰貼貴貺貸貿費賀貽賊贄賈賄貲賃賂贓資賅贐賕賑賚賒賦賭齎贖賞賜贔賙賡賠賧賴賵贅賻賺賽賾贗贊讚贇贈贍贏"
			+ "贛赬趙趕趨趲躉躍蹌蹠躒踐躂蹺蹕躚躋踴躊蹤躓躑躡蹣躕躥躪躦軀車軋軌軒軑軔轉軛輪軟轟軲軻轤軸軹軼軤軫轢軺"
			+ "輕軾載輊轎輈輇輅較輒輔輛輦輩煇輝輥輞輬輟輜輳輻輯轀輸轡轅轄輾轆轍轔辭闢辯辮邊遼達遷過邁運還這進遠違連"
			+ "遲邇疊逕跡蹟適選遜遞邐邏遺遙鄧鄺鄔郵鄒鄴鄰鬱郤郟鄶鄭鄆酈鄖鄲醞醱醯醬痠釅釃釀採釋裡裏钜鑑鑒鑾鏨釓釔鍼"
			+ "針釘釗釙釕釷釺釧釤鈒釩釣鍆釹鍚釵鈃鈣鈈鈦鈍鈔鍾鐘鈉鋇鋼鈑鈐鑰籥欽鈞鎢鉤鈧鈁鈥鈄鈕鈀鈺錢鉦鉗鈷缽鈳鉕鈽"
			+ "鈸鉞鑽鉬鉭鉀鈿鈾鐵鉑鈴鑠鉛鉚鈰鉉鉈鉍鈮鈹鐸鉶銬銠鉺鋩錏銪鋏鋣鐃銍鐺銅鋁銱銦鎧鍘銖銑鋌銩銛鏵銓鎩鉿銚鉻"
			+ "銘錚銫鉸銥剷鏟銃鐋銨銀銣鑄鐒鋪舖鋙錸鋱鏈鏗銷鎖鋰鋥鋤鍋鋯鋨鏽銼鋝鋒鋅鋶鐦鐧銳銻鋃鋟鋦錒錆鍺錯錨錛錡錁"
			+ "錕錩錫錮鑼錘鎚錐錦鑕鍁錈錇錟錠鍵鋸錳錙鍥鍈鍇鏘鍶鍔鍤鍬鍾鍛鎪鍠鍰鎄鍍鎂鏤鎡鋂鏌鎮鎛鎘鑷钂鐫鎳鎿鎦鎬鎊"
			+ "鎰鎵鑌鎔鏢鏜鏝鏍鏰鏞鏡鏑鏃鏇鏐鐔钁鐐鏷鑥鐓鑭鐠鑹鏹鐙鑊鐳鐶鐲鐮鐿鑔鑣鑞鑱鑲長門閂閃閆閈閉問闖閏闈閒閑"
			+ "閎間閔閌悶閘鬨鬧閨聞闥閩閭闓閥閣閡閫鬮閱閬闍閾閹閶鬩閿閽閻閼闡闌闃闠闊闋闔闐闒闕闞闤隊陽陰陣階際陸隴"
			+ "陳陘陝隉隕險隨隱隸雋難僱雛彫讎靂霧霽黴靄靚靜麵靨韃鞽韉韝韋韌韍韓韙韞韜韻頁頂頃頇項順須鬚頊頑顧頓頎頒"
			+ "頌頏預顱領頗頸頡頰頲頜潁熲頦頤頻頮頹頽頷頴穎顆題顒顎顓顏額顳顢顛顙顥纇顫顬顰顴風颺颭颮颯颶颸颼颻飀飄"
			+ "飆飆飛饗饜飣飢饑飥餳飩餼飪飫飭飯飲餞飾飽飼飿飴餌饒餉餄餎餃餏餅餑餖餓餘餒餕餜餛餡館餷饋餽餶餿饞饁饃餺"
			+ "餾饈饉饅饊饌饢馬馭馱馴馳敺驅馹駁駮驢駔駛駟駙駒騶駐駝駑駕驛駘驍罵駰驕驊駱駭駢驫驪騁驗騂駸駿騏騎騍騅騌"
			+ "驌驂騙騭騤騷騖驁騮騫騸驃騾驄驏驟驥驦驤髏髖髕騣鬢魘魎魚魛魢魷魨魯魴魺鮁鮃鯰鱸鮋鮓鮒鮊鮑鱟鮍鮐鮭鮚鮳鮪"
			+ "鮞鮦鰂鮜鱠鱭鮫鮮鮺鯗鱘鯁骾鱺鰱鰹鯉鰣鰷鯀鯊鯇鮶鯽鯒鯖鯪鯕鯫鯡鯤鯧鯝鯢鯰鯛鯨鯵鯴鯔鱝鰈鰏鱨鯷鰮鰃鰓鱷鰍"
			+ "鰒鰉鰁鱂鯿鰠鼇鰲鰭鰨鰥鰩鰟鰜鰳鰾鱈鱉鰻鰵鱅鰼鱖鱔鱗鱒鱯鱤鱧鱣鳥鳩雞鳶鳴鳲鷗鴉鶬鴇鴆鴣鶇鸕鴨鴞鴦鴒鴟鴝"
			+ "鴛鴬鴕鷥鷙鴯鴰鵂鴴鵃鴿鸞鴻鵐鵓鸝鵑鵠鵝鵒鷳鵜鵡鵲鶓鵪鶤鵯鵬鵮鶉鶊鵷鷫鶘鶡鶚鶻鶖鶿鷀鶥鶩鷊鷂鶲鶹鶺鷁鶼"
			+ "鶴鷖鸚鷓鷚鷯鷦鷲鷸鷺鸇鷹鸌鸏鸛鸘鹺麥麩黃黌黶黷黲黽黿鼂鼉鞀鼴齇齊齏齒齔齕齗齟齡齙齠齜齦齬齪齲齷龍龔龕龜";
}